fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоДней</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// 1. Получаем адрес из параметров
	Адрес = Параметры.АдресВХранилище;
	
	// 2. Получаем данные (это ДанныеФормыСтруктура, копия Объекта из первой формы)
	ДанныеГрафика = ПолучитьИзВременногоХранилища(Адрес);
	
	// 3. Настраиваем диаграмму
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.ОтображатьЗаголовок = Ложь;
	
	// 4. Заполняем данными
	Для Каждого СтрокаТЧ Из ДанныеГрафика.ОтпускаСотрудников Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаНачала) 
			Или Не ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;
		
		// Точка = Сотрудник
		Точка = ДиаграммаГанта.УстановитьТочку(СтрокаТЧ.Сотрудник);
		
		// Серия = Просто "Отпуск" (можно сделать год)
		Серия = ДиаграммаГанта.УстановитьСерию("Основной отпуск");
		
		// Получаем значение (интервалы) на пересечении Точки и Серии
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		// Добавляем интервал
		Интервал = Значение.Добавить();
		Интервал.Начало = СтрокаТЧ.ДатаНачала;
		Интервал.Конец   = СтрокаТЧ.ДатаОкончания;
		
		// Можно раскрасить
		Интервал.Цвет = WebЦвета.Зеленый;
		
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры
